In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('Income_Data.csv')

In [5]:
df

        Name  Age  Income($)
0        Rob   27      70000
1    Michael   29      90000
2      Mohan   29      61000
3     Ismail   28      60000
4       Kory   42     150000
5     Gautam   39     155000
6      David   41     160000
7     Andrea   38     162000
8       Brad   36     156000
9   Angelina   35     130000
10    Donald   37     137000
11       Tom   26      45000
12    Arnold   27      48000
13     Jared   28      51000
14     Stark   29      49500
15    Ranbir   32      53000
16    Dipika   40      65000
17  Priyanka   41      63000
18      Nick   43      64000
19      Alia   39      80000
20       Sid   41      82000
21     Abdul   39      58000

In [7]:
df['Income($)']

0      70000
1      90000
2      61000
3      60000
4     150000
5     155000
6     160000
7     162000
8     156000
9     130000
10    137000
11     45000
12     48000
13     51000
14     49500
15     53000
16     65000
17     63000
18     64000
19     80000
20     82000
21     58000
Name: Income($), dtype: int64

In [9]:
df['Income($)'].max()

162000

In [10]:
df['Income($)'].min()

45000